{
  "e0a506cd-dd0b-4957-9657-286fc64c521c": {
    "status": "done",
    "transcript": "For a sharp handsome young man like you aren't, it's an easy thing to control the opening as white. But half the games you'll find yourself being black. Now white is in control and you just make up a game plan move by move. Don't worry, the Karo-Khan is a legendary defense that you can use to dominate as black. In the Karo-Khan defense you break up their center like this and no matter what they do, you have a straightforward game plan to take control over the board. And believe it or not, many times you'll capture both pawns and end up with a superior pawn structure that allows you to bully your opponent all game long. It's a legendary opening because it's not only strong in lower elo, it's very strong in high elo chess too. Promise me to carefully pay attention right now, don't look at the suggested videos, go full screen. If you stick with me for the next couple minutes and properly understand this opening, you'll have a game plan for most of your black games for the rest of your life. In the Karo-Kan, each of your pieces has its very own specific mission. Let's start with these pawns. Now obviously their mission is to attack the center. By the way another common move is knight f3 instead of this pawn move, but you push the pawns like this anyway. Doesn't matter, when you do that, white can either take, push or defend their pawn. For the sake of explaining the game plan let's say they push. If you were a Grandmaster you should probably get your Bishop out right now. But for anyone under 2000 LO, the stronger and easier option is to just stick with the game plan, meaning you attack the center by pushing this pawn. Remember, these pawns want to break up the center. Now it doesn't really matter if they defend their pawn or take your pawn, in both cases your Knight's mission is to apply more pressure to the center. So it goes here. Most times they will defend the E pawn with the Knight. And that's what your Bishop has been waiting for. Pin the Knight like this. Whenever they bring out the knight, you pin it with the bishop. Even if it happens later in the game, you just wait to pin this knight. So your knight mission is to apply more pressure to the center by going here Your bishop mission is to pin this knight so that the knight can defend this pawn anymore Let take a look at this bishop By the way one quick thing if the knight gets pinned by the bishop, that's a little annoying but you can literally just wait because if they actually trade, your pawn structure becomes even more powerful. Anyway, this bishop right here is waiting for you to push the e-pawn. When you push, it opens the line for the attack on the c-pawn. Sometimes they just let you take it. If they defend it, you're ready to apply even more pressure and cause severe headaches with this knight. Go to e7 and then go to f5, attacking this bishop. So this knight's mission is basically to attack the black square bishop that will likely try to defend one of the pawns in the center. So if the bishop went here to defend this pawn in another game, you can go here to attack the bishop and the pawn at the same time. Just attack the defending bishop, it's actually pretty simple, I promise from now on it will be easier, that was the most complex part. By the way your bishop is just chilling. Once they attack it, you can trade like this and the e-pawn lost his defense. Those are the game plans for each of your pieces. In many games you'll just win both pawns because Wyatt is not familiar with the Karo-Khan. But, this was the advanced variation. What if they take? Don't worry, the take variation with the name exchange variation is the easiest to play. In fact, everything from now on is easier. So let's talk about what happens when they take in this position instead of pushing. By the way, in some games you won't see this double pawn, instead they open with e4 and then play their knight. But that doesn't really matter because usually they take your pawn after this. And as long as they take, it's the exchange variation. We'll cover it with a very easy setup. Let's look at the double pawn version though. If they take, you take back. This time, there is no advanced pawn. Meaning it's a lot simpler to pressure the center. Not necessarily stronger, it's just simpler to play. Attack with the knight, get your other knight out to f6, there is no reason to go the long route in this game, then get your bishop out to f5 or g4. Then push your pawn after getting the bishop out so it doesn get stuck Develop your other bishop maybe like this Later you can castle Most of the time when they go for the exchange variation you can literally just go for this setup, unless, they attack with this pawn after exchanging. In that case you should develop this knight first instead of this knight. Everything else can stay the same. Don't take the pawn, they can take back and develop a bishop for free. Just defend it. But the setup is super simple, just learn the moves. We have one more variation to cover. So the first version was the advanced variation where they push the pawn and we've covered the individual missions of your pieces earlier. If they take your pawn, you're in the exchange variation that we just covered. The last thing we need to take a look at right now is what to do if they don't take. If they don't take your pawn, they usually defend with the knight. You might see some other wild move every once in a while, but every other move besides this knight is not even worth studying because they're so rare. In this knight defense case you can take the pawn, they take back and you both lost a center pawn which is completely fine. In the classical variation you attack the knight with your bishop. Often you'll see something like this. Make sure to not get your bishop trapped. I have bad news and good news. The bad news is that this line has extremely complex theory. The good news is that 99% of your opponents don't know the theory so you can just use your brain and play normal chess. Let's do something better because learning all the theory right now would be a waste of time. We'll take a look at a real game that shows you how to use the caracan to win. This game happened in 1700 elo and it shows how to dominate the center and how to use that dominance to win the game. White pushes the pawn, the advanced variation, and black attacks the center. White decides to defend the center with the pawn. Do you remember what black should do now? Correct, the knight basically always wants to apply pressure like this. They bring their knight out and the bishop pins it immediately. They unpin the knight and black frees the bishop and knight by pushing this pawn. White castles and black brings out the second knight Now they attack the bishop hoping to get rid of it But black takes the knight and after trading pieces black brings the second knight to f5 Now this pawn is attacked three times but only defended by two pieces White doesn't want to take because it's a valuable center pawn and black could develop a bishop for free. So white tries to defend with the bishop. Black brings out the queen, adding more pressure to the center and attacking this pawn. White makes the decision to defend this pawn, but sacrifices the center by doing so. Black takes, White takes, Black takes, White takes, Black takes with the queen, basically forcing White to take back with the queen because the rook is under attack. White takes and Black takes back with the knight. Black is now up a pawn and has the stronger center. But it's about to get worse. You should pay attention now because you'll see how Black uses this dominant center to win the game like an unstoppable force. So Black is up a pawn and controls the center. Now White brings out the knight and Black attacks it by developing the bishop. White defends the knight with the rook and black moves the knight over here, attacking the second center pawn. The only way to defend it is to play this rook. And now black attacks the pawn again. Because white has a weak center, there is no way to defend the pawn now. The other center pawn that was defending this pawn is already gone. The dominance is compounding. Black takes the pawn and his two pawns up with an even more dominant position. Black then takes the bishop, which white has to take back with the pawn because the bishop pins this knight. After a little trading of pieces, black remains with a superior position, which allows black to conquer another pawn. Some pawn pushing later, black is absolutely dominating the board and is about to win. The good thing about dominant positions is, that your opponent has 20 different options to lose the game. White chose to attack this pawn. Seems like a good move, but after black pushing this pawn, white makes the fatal mistake to take the pawn. The game was kind of over anyway, but after those moves, white can't stop the pawn from becoming a queen and resigns the game. If you forget some of the moves you can just rewatch this video anytime. Check out the join button to see what I mentioned earlier. Or just watch another video.",
    "title": "https://www.youtube.com/watch?v=0p_881Nwoo4"
  }
}